import { Component } from '@angular/core';
import { RouterLink } from '@angular/router';

@Component({
  selector: 'app-privacy',
  standalone: true,
  imports: [RouterLink],
  templateUrl: './privacy.html',
})
export class Privacy {
  lastUpdate = '15 يناير 2026';
  email = 'hello@adasah.com'; // غيّره لإيميلك

  sections: { title: string; text?: string; items?: { label?: string; text: string }[] }[] = [
    {
      title: 'مقدمة',
      text: 'مرحباً بك في عدسة. نحن نحترم خصوصيتك وملتزمون بحماية بياناتك الشخصية. ستعلمك سياسة الخصوصية هذه بكيفية العناية ببياناتك الشخصية عند زيارة موقعنا وتخبرك عن حقوق الخصوصية الخاصة بك.',
    },
    {
      title: 'المعلومات التي نجمعها',
      items: [
        {
          label: 'بيانات الهوية:',
          text: 'تشمل الاسم الأول، الاسم الأخير، اسم المستخدم أو معرف مشابه.',
        },
        { label: 'بيانات الاتصال:', text: 'تشمل عنوان البريد الإلكتروني.' },
        {
          label: 'البيانات التقنية:',
          text: 'تشمل عنوان IP، نوع المتصفح، المنطقة الزمنية، ونظام التشغيل.',
        },
        { label: 'بيانات الاستخدام:', text: 'تشمل معلومات حول كيفية استخدامك لموقعنا وخدماتنا.' },
      ],
    },
    {
      title: 'كيف نستخدم معلوماتك',
      items: [
        { text: 'لتقديم خدمتنا والحفاظ عليها' },
        { text: 'لإخطارك بالتغييرات في خدمتنا' },
        { text: 'لتقديم دعم العملاء' },
        { text: 'لجمع تحليلات أو معلومات قيمة لتحسين خدمتنا' },
        { text: 'لمراقبة استخدام خدمتنا' },
        { text: 'لاكتشاف ومنع ومعالجة المشاكل التقنية' },
      ],
    },
    {
      title: 'ملفات تعريف الارتباط',
      text: 'نستخدم ملفات تعريف الارتباط وتقنيات التتبع المشابهة لتتبع النشاط على موقعنا. يمكنك توجيه متصفحك لرفض جميع ملفات تعريف الارتباط أو للإشارة عند إرسال ملف تعريف ارتباط. ومع ذلك، إذا لم تقبل ملفات تعريف الارتباط، فقد لا تتمكن من استخدام بعض أجزاء موقعنا.',
    },
    {
      title: 'أمان البيانات',
      text: 'لقد وضعنا تدابير أمنية مناسبة لمنع فقدان بياناتك الشخصية أو استخدامها أو الوصول إليها بشكل غير مصرح به عن طريق الخطأ. نحن نحد الوصول إلى بياناتك الشخصية لأولئك الذين لديهم حاجة عملية للمعرفة.',
    },
    {
      title: 'حقوقك',
      items: [
        { text: 'طلب الوصول إلى بياناتك الشخصية' },
        { text: 'طلب تصحيح بياناتك الشخصية' },
        { text: 'طلب مسح بياناتك الشخصية' },
        { text: 'الاعتراض على معالجة بياناتك الشخصية' },
        { text: 'طلب تقييد معالجة بياناتك الشخصية' },
        { text: 'الحق في سحب الموافقة' },
      ],
    },
  ];
}
